src/Documents/ЗаданиеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеНаРаботу</Name>
			<RegisterRecords>
				<xr:Item>InformationRegister.Пр_ПланФактовоеОтклонение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пр_Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_ОценкаВGitLab</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_ФактВGitLab</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КалендарьСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заказчик</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦенКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Пр_ПланФактовоеОтклонение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Пр_ПланФактовоеОтклонение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановыеЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическиеЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаРаботу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ЗаданиеНаРаботу/Ext/ObjectModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура Пр_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	РазработкаПоЧасам = Пр_КорпоративнаяСистемаGitLabВстраиваниеУНФСервер.НоменклатураРазработкаПоЧасам();
	
	Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пр_Проект, "Договор", Истина);
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "Владелец, ВидЦенКонтрагента", Истина);
	
	ВидЦенКонтрагента = РеквизитыДоговора.ВидЦенКонтрагента;
	Если Не ЗначениеЗаполнено(ВидЦенКонтрагента) Тогда      
		СтруктураВидаЦен = Новый Структура("Контрагент, Проект", РеквизитыДоговора.Владелец, Пр_Проект);
		ВидЦенКонтрагента = Справочники.ВидыЦенКонтрагентов.СоздатьВидЦенКонтрагента(СтруктураВидаЦен,
																					 Константы.ВалютаУчета.Получить()); 
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);																			 
		Попытка
			ДоговорОбъект = Договор.ПолучитьОбъект();
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ДоговорыКонтрагентов");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Договор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ДоговорОбъект.ВидЦенКонтрагента = ВидЦенКонтрагента;
			ДоговорОбъект.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю("ru = 'Не удалось создать автоматически новый вид цен контрагента'",,,,Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
		|			&ДатаДокумента,
		|			ВидЦенКонтрагента = &ВидЦенКонтрагента
		|				И Номенклатура = &РазработкаПоЧасам) КАК Т";
	
	Запрос.УстановитьПараметр("ВидЦенКонтрагента", ВидЦенКонтрагента);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("РазработкаПоЧасам", РазработкаПоЧасам);
	Выборка = Запрос.Выполнить().Выбрать(); 	
	
	Если Выборка.Следующий() Тогда
		ЦенаЧас = Выборка.Цена;	
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо указать цену разработки по часам для текущего вида цен'"),,,,Отказ);
		Возврат;
	КонецЕсли;
	
	СтарыйКомментарий = "";
	Если Работы.Количество() Тогда
		СтарыйКомментарий = Работы[0].Комментарий;
	КонецЕсли;
	
	Работы.Очистить();
	СтрокаРабот = Работы.Добавить();
	СтрокаРабот.Номенклатура = РазработкаПоЧасам;
	СтрокаРабот.Заказчик = Договор; 
	СтрокаРабот.Трудоемкость = Пр_ФактВGitLab;
	СтрокаРабот.Цена = ЦенаЧас;
	СтрокаРабот.Сумма = СтрокаРабот.Трудоемкость * СтрокаРабот.Цена;
	Комментарий = СтрШаблон(НСтр("ru = 'Разработка по часам за %1'"),
										Формат(Дата, "ДФ='MMMM yyyy'"));
	СтрокаРабот.ДатаНачала = Дата;
	КоличествоПолныхДней = Цел(Пр_ФактВGitLab / 8);    
	ОстатокВЧасах = Пр_ФактВGitLab - 8 * КоличествоПолныхДней;
	СтрокаРабот.ДатаОкончания = Дата + (КоличествоПолныхДней * 24*60*60) + ОстатокВЧасах * 3600;
	СтрокаРабот.Комментарий = СтарыйКомментарий;
	
	СуммаДокумента = СтрокаРабот.Сумма;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура Пр_ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("ЭтоНовый")
		 И ДополнительныеСвойства.ЭтоНовый
	Тогда
	
		Если ДополнительныеСвойства.Свойство("ЭтоЗагрузкаДанных") И
			 ДополнительныеСвойства.ЭтоЗагрузкаДанных
		Тогда
			// ничего не делаем
		Иначе
			Узел = ПланыОбмена.Пр_ОбменGitLab.НайтиПоКоду("GitLab");
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Пр_ОбработкаПроведения(Отказ, РежимПроведения)
				
	СотрудникБэклог = Пр_КорпоративнаяСистемаGitLabВстраиваниеУНФСервер.СтруктураПользователяБэклог().Сотрудник; 
	Если Сотрудник <> СотрудникБэклог Тогда
		Движения.Пр_ПланФактовоеОтклонение.Записывать = Истина;
		Движения.Пр_ПланФактовоеОтклонение.Очистить();
		Движения.Пр_ПланФактовоеОтклонение.Записать();

		Движение = Движения.Пр_ПланФактовоеОтклонение.Добавить();
		Движение.Регистратор = Ссылка;  
		Движение.Проект = Пр_Проект;
		Движение.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пр_Проект, "Контрагент", Истина); 
		Движение.ЗаданиеНаРаботу = Ссылка;
		Движение.Разработчик = Сотрудник;
		Движение.ПлановыеЗатраты = Пр_ОценкаВGitLab;
		Движение.ФактическиеЗатраты = Пр_ФактВGitLab; 
		Движение.Разница = Движение.ПлановыеЗатраты - Движение.ФактическиеЗатраты;
		
		Движения.Пр_ПланФактовоеОтклонение.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура Пр_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	СтратегияЗаполнения[Тип("ДокументСсылка.Событие")] = "ЗаполнитьПоСобытию";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
	
	#Вставка
	Если ДанныеЗаполнения = Неопределено Тогда	
		
		ДанныеЗаполнения = Новый Структура;	  
		
		СтруктурнаяЕдиницаПрограммисты = Пр_КорпоративнаяСистемаGitLabВстраиваниеУНФСервер.СтруктурнаяЕдиницаПрограммисты();
		ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиницаПрограммисты);         
		
		СтруктураПользователяБэклог = Пр_КорпоративнаяСистемаGitLabВстраиваниеУНФСервер.СтруктураПользователяБэклог();
		ДанныеЗаполнения.Вставить("Сотрудник", СтруктураПользователяБэклог.Сотрудник);
				
	КонецЕсли;    
	#КонецВставки
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения, "Состояние");

	Если Работы.Количество() = 0 Тогда
		Работы.Добавить();
	КонецЕсли;

	ДозаполнитьПоУмолчанию();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
